In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
#add the series together
#adds where the index value matches, replace with a null if doesnot find any
ser1 + ser2

A     3
B     5
C     7
D   NaN
dtype: float64

In [6]:
#dframe
# to make the columns use the python code list and just add AB
dFrame1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),
                   index =['NYC','LA'])
dFrame1

     A  B
NYC  0  1
LA   2  3

In [9]:
dFrame2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),
                   index =['NYC','SF','LA'])
dFrame2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [10]:
#add two dframes
#row index and column match ups are the only one added
dFrame1 + dFrame2

      A   B   C   D
LA    8 NaN NaN NaN
NYC   0 NaN NaN NaN
SF  NaN NaN NaN NaN

In [11]:
#replace the null values
dFrame1

     A  B
NYC  0  1
LA   2  3

In [12]:
dFrame1.add(dFrame2,fill_value = 0)
#only 1 null value, filed in 0 for the 2nd dataframe and kept the original dframe1 values
#important tool for adding different size dataFrame and do not want to lose the values

     A   B  C  D
LA   8   3  8  7
NYC  0   1  2  1
SF   3 NaN  5  4

In [13]:
ser3 = dFrame2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [14]:
dFrame2-ser3
# values for nyc row is substracted

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6